Revit 2027 API
TableSectionData.GetCellType(Int32, Int32) Method
 Returns a cell's Type and if no Type exists for this cell, it would come from the column, or the row, or the section
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CellType GetCellType(
	int nRow,
	int nCol
)
Public Function GetCellType (
	nRow As Integer,
	nCol As Integer
) As CellType
public:
CellType GetCellType(
	int nRow,
	int nCol
)
member GetCellType :
        nRow : int *
        nCol : int -> CellType
Parameters
nRow Int32
nCol Int32
Return Value
CellType
Exceptions
Exception | Condition
ArgumentException |  The given row number nRow is invalid. -or- The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
GetCellType Overload
Autodesk.Revit.DB Namespace